import random


# базовый класс предметов
class Item:
    def __init__(self, name):
        # задаём название предмета
        self.name = name


class Potion(Item):
    def use(self, game):
        # абстрактный метод использования зелий
        pass


class Equipment(Item):
    def __init__(self, name, slot, power=0, defense=0, crit=0, dodge=0):
        super().__init__(name)

        # устанавливаем слот экипировки ("оружие" или "броня")
        self.slot = slot

        # статичные бонусы предмета
        self.power = power  # сила атаки
        self.defense = defense  # защита
        self.crit = crit  # крит удар
        self.dodge = dodge  # уклонение

        # если предмет броня, добавляем ей прочность
        if self.slot == "armor":
            # начальная прочность равна базовой плюс бонус защиты
            self.durability = 10 + self.defense


# генератор случайной экипировки
def generate_equipment():
    # выбираем случайный слот экипировки
    slot = random.choice(["weapon", "armor"])

    # создаём имя предмета и рандомные характеристики
    if slot == "weapon":
        name = random.choice(["Короткий меч", "Старый клинок", "Секира"])
        power = random.randint(5, 15)  # сила оружия
        crit = random.randint(5, 15)  # шанс крита
    else:
        name = random.choice(["Лёгкая броня", "Кожаный доспех", "Пластинчатый доспех"])
        defense = random.randint(5, 15)  # защита брони
        dodge = random.randint(5, 15)  # уклонение

    # создаем новый предмет экипировки
    eq = Equipment(name, slot, power, defense, crit, dodge)
    return eq


# обработчик найденной экипировки
def found_equipment(game, eq=None):
    # если не передано ничего, то генерируем новое снаряжение
    if not eq:
        eq = generate_equipment()

    # сообщаем игроку о находке
    print(f"\nВы нашли экипировку: {eq.name}")
    print(f"Сила: {eq.power}, Защита: {eq.defense}, Крит: {eq.crit}, Уклонение: {eq.dodge}")
    print("1. Надеть\n2. Положить в инвентарь")

    # получаем выбор игрока
    choice = input("> ")
    if choice == "1":
        # игрок решил надеть предмет
        equip_item(game, eq)
    else:
        # кладём в инвентарь
        game.inventory.append(eq)
        print(f"{eq.name} положен в инвентарь.")


def equip_item(game, item):
    # куда будем ставить предмет
    slot = item.slot
    hero = game.hero

    # смотрим надето ли что-то
    current = hero.equipment.get(slot)

    if current:
        # слот уже занят другим предметом
        print(f"\nСлот {slot} уже занят!")
        print(
            f"Сейчас надето: {current.name} | Сила:{current.power} Защита:{current.defense} Крит:{current.crit} Уклонение:{current.dodge}")
        print(
            f"Найдена экипировка: {item.name} | Сила:{item.power} Защита:{item.defense} Крит:{item.crit} Уклонение:{item.dodge}")
        print("Хотите поменять экипировку? (1 - Да, 2 - Нет)")

        # запрашиваем подтверждение замены
        choice = input("> ")
        if choice == "1":
            # переносим старый предмет в инвентарь
            print(f"📦 {current.name} перемещена в инвентарь.")
            game.inventory.append(current)

            # надеваем новый предмет
            hero.equipment[slot] = item
            apply_equipment_effect(hero, item)
            print(f"Вы надели {item.name}.")
        else:
            # новая экипировка отправляется в инвентарь
            print(f"📦 {item.name} положена в инвентарь.")
            game.inventory.append(item)
    else:
        # если свободный слот, то сразу одеваем
        hero.equipment[slot] = item
        apply_equipment_effect(hero, item)
        print(f"Вы надели {item.name}.")


# применение эффектов экипировки на персонажа
def apply_equipment_effect(hero, item):
    # прибавляем эффекты предмета герою
    hero.power += item.power
    hero.crit += item.crit
    hero.dodge += item.dodge
    # если предмет броня, то применяем временную защиту
    if item.slot == "armor":
        hero.temp_defense += item.defense
        if not hasattr(item, "durability"):
            # базовая прочность брони
            item.durability = 10 + item.defense


# зелье восстановления здоровья
class HealPotion(Potion):
    def __init__(self):
        # задаём название
        super().__init__("Зелье лечения")
        self.heal = 60  # количество восстанавливаемого здоровья

    def use(self, game):
        # восстанавливаем здоровье герою
        hero = game.hero
        hero.hp += self.heal
        if hero.hp > hero.max_hp:
            hero.hp = hero.max_hp
        print(f"Вы восстановили {self.heal} HP!")


# зелье повышения силы
class StrengthPotion(Potion):
    def __init__(self):
        # создаём зелье силы
        super().__init__("Зелье силы")

    def use(self, game):
        # временно повышает силу героя на 10 единиц
        game.effects.append({"type": "strength", "value": 10, "turns": 2})
        print("Урон увеличен на 10!")


# зелье крит удара
class CritPotion(Potion):
    def __init__(self):
        # создаем зелье крита
        super().__init__("Зелье крита")

    def use(self, game):
        # временно увеличивает шанс критического удара на 20%
        game.effects.append({"type": "crit_up", "value": 20, "turns": 2})
        print("Шанс критического удара увеличен на 20%!")
class DodgePotion(Potion):
    def __init__(self):
        # атрибуты род. класса
        super().__init__("Зелье уклонения")


    def use(self, game):
        # добавляет эффект увеличения шанса уклонения на 20%
        game.effects.append({"type": "dodge_up", "value": 20, "turns": 2})
        print(" Шанс уклонения увеличен на 20%!")


class PoisonPotion(Potion):
    def __init__(self):
        # создает объект зелья яда
        super().__init__("Зелье яда")


    def use(self, game):
        # накладывает яд на врага
        game.effects.append({"type": "poison", "damage": 10, "turns": 3})
        print("️ Враг отравлен (10 урона за раунд)!")


class BleedPotion(Potion):
    def __init__(self):
        # создаёт объект зелья кровотечения
        super().__init__("Зелье кровотечения")


    def use(self, game):
        # применяет кровотечение, которое снимает 5% здоровья врага
        game.effects.append({"type": "bleed", "percent": 0.05, "turns": 3})
        print(" Враг истекает кровью (5% HP за раунд)!")



# поиск предметов
def search_container(game, name):
    # обыск сундуков/шкафов
    import random
    print(f"\n Вы обыскиваете {name}...")
    roll = random.randint(1, 100)  # случайное число определяет выпадение предмета

    # таблица вероятности нахождения разных типов предметов
    if roll <= 25:
        item = HealPotion()   # лечебное зелье
    elif roll <= 45:
        item = StrengthPotion()  # зелье силы
    elif roll <= 60:
        item = CritPotion()     # зелье крита
    elif roll <= 70:
        item = DodgePotion()    # зелье уклонения
    elif roll <= 80:
        item = PoisonPotion()   # ядовитое зелье
    elif roll <= 90:
        item = BleedPotion()    # кровоточащее зелье
    else:
        item = generate_equipment()  # выдаёт предмет экипировки

    # проверяем нашли ли мы экип или обычный предмет
    if isinstance(item, Equipment):
        found_equipment(game, item)  # обрабатываем найденную экипировку отдельно
    else:
        game.inventory.append(item)  # добавляем предмет в инвентарь игрока
        print(f" Найдено: {item.name}")  # выводим название предмета


def drop_loot(game):
    # лут после победы
    import random
    roll = random.randint(1, 100)  # определяем какой предмет выпал случайно

    # вероятность появления предметов после боя
    if roll <= 30:
        eq = generate_equipment()  # генерируем новую экипировку
        found_equipment(game, eq)  # обрабатываем её получение игроком
    elif roll <= 50:
        item = HealPotion()      # лечение
        game.inventory.append(item)
        print(" Выпало: Зелье лечения")
    elif roll <= 60:
        item = StrengthPotion()  # увеличивает силу героя
        game.inventory.append(item)
        print(" Выпало: Зелье силы")
    elif roll <= 75:
        item = PoisonPotion()    # отравляет врага
        game.inventory.append(item)
        print(" Выпало: Зелье яда")
    elif roll <= 80:
        item = BleedPotion()     # наносит случайный урон противнику
        game.inventory.append(item)
        print(" Выпало: Зелье кровотечения")
    else:
        # иногда выпадает доп экипировка
        eq = generate_equipment()
        found_equipment(game, eq)
